БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаТоваров</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>TRADENAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LATNAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGNUM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>REGDATE</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_REGISTRATOR</name>
    <comment>Организация-регистратор</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_REGISTRATOR</name>
    <comment>Страна организации-регистратора</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMGROUP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>STATUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NDV</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGCERTID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMAACTIONS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>STRONG</name>
    <type>
      <types>EnumRef.СильнодействующиеИЯды</types>
    </type>
  </attributes>
  <attributes>
    <name>JNVLS</name>
    <type>
      <types>EnumRef.СпискиЖНиВЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>NARCO</name>
    <type>
      <types>EnumRef.СпискиНаркотическихВеществ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЕдиницыУслуги</name>
    <comment>Одна единица услуги имеет данную продолжительность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМедицинскихУслуг</name>
    <type>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовкаКлиентаКСдачеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DICOMModality</name>
    <type>
      <types>CatalogRef.DICOMModality</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>МедосмотрСправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦенаМедосмотраИзДействийМедосмотра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛП</name>
    <comment>Код лекарства в ЕСКЛП РФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АТХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМедУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованнаяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВредныйФакторСправки</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФомированияЦеныМедосмотра</name>
    <type>
      <types>EnumRef.СпособФормированияЦеныМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеНоменклатуры</name>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.МоделиОборудования</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеDICOM</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру обязательных / уникальных реквизитов элемента.
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента.
// Если ДляГруппы = Истина, аналогично для группы.
//
// Параметры:
//	ДляЭлемента	- Булево - проверяется элемент справочника.
//	ДляГруппы	- Булево - проверяется группа справочника.
//
// Возвращаемое значение:
//	Произвольный - Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры 
//					для табличных частей.
//					Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный.
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Наименование",1);

    Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("ВидНоменклатуры",1);
		Если ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Набор Тогда
			ОбязательныеРеквизиты.Вставить("КатегорияВыработки",1);
		КонецЕсли;
		Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			ОбязательныеРеквизиты.Вставить("БазоваяЕдиницаИзмерения",1);
		КонецЕсли;                                                             
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;

	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// 
// Параетры:
//	Ошибки - Строка, В случае некорректного заполнения функция формирует строку описанием возникших ошибок "Ошибки".
//	ДопРеквизиты - Произвольный, может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки.
//	Заполнение	 - Булево, флаг необходимости проверки заполнения обязательных реквизитов.
//	Уникальность - Булево, флаг необходимости проверки уникальности элемента в разрезе реквизитов, отмеченных в структуре как 
//		контролируемые на уникальность.
//
// Параметры:
//  Ошибки - Строка - По умолчанию ""
//  ДопРеквизиты - Неопределено - По умолчанию Неопределено
//  Заполнение - Булево - По умолчанию Истина
//  Уникальность - Булево - По умолчанию Истина
//
// Возвращаемое значение:
//	Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	#Если Не ТолстыйКлиентОбычноеприложение Тогда
	Возврат ОбщегоНазначенияСервер.ПроверитьКорректностьЗаполненияСправочника(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	#КонецЕсли 
КонецФункции

// Функция ОбновитьСопутствующиеУнаследованные
//
// Возвращаемое значение:
//  Произвольный.
//
Функция ОбновитьСопутствующиеУнаследованные() Экспорт
	
	ЗапросРодители = Новый Запрос;
	ЗапросРодители.Текст = "ВЫБРАТЬ
	|	ТаблНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблНоменклатура
	|ГДЕ
	|	ТаблНоменклатура.Ссылка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ТаблНоменклатура.Код = &Код
	|ИТОГИ ПО
	|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
	
	ЗапросРодители.УстановитьПараметр("Код", Код);
	
	Родители = ЗапросРодители.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураСопутствующиеТовары.Номенклатура КАК Номенклатура,
	               |	НоменклатураСопутствующиеТовары.Ссылка КАК Владелец,
	               |	НоменклатураСопутствующиеТовары.Номенклатура.Код КАК Код,
	               |	НоменклатураСопутствующиеТовары.Номенклатура.Артикул КАК Артикул,
	               |	НоменклатураСопутствующиеТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура.СопутствующиеТовары КАК НоменклатураСопутствующиеТовары
	               |ГДЕ
	               |	НоменклатураСопутствующиеТовары.Ссылка В(&Табл1)
	               |	И НоменклатураСопутствующиеТовары.Номенклатура.Код <> &Код
	               |	И НоменклатураСопутствующиеТовары.Ссылка.Код <> &Код";
				   
	Запрос.УстановитьПараметр("Табл1",Родители); 
	Запрос.УстановитьПараметр("Код", Код);
	
	ТЗ  = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда
		
		мас = Новый Массив();
		
		Для Каждого СтрТЗ Из ТЗ Цикл
			стр = Новый Структура("Код", СтрТЗ.Код);
			стр.Вставить("Номенклатура", СтрТЗ.Номенклатура);
			стр.Вставить("Артикул", СтрТЗ.Артикул);
			стр.Вставить("ВидНоменклатуры", СтрТЗ.ВидНоменклатуры);
			стр.Вставить("Владелец", СтрТЗ.Владелец);
			мас.Добавить(стр);
		КонецЦикла;
		
		Возврат мас;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

// Стандартный обработчик заполнения при вводе нового на основании.
//
// Параметры:
//  Основание - Произвольный.
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	РодительскаяГруппа=ЭтотОбъект.Родитель;
	Если ЭтотОбъект.ЭтоГруппа=Ложь Тогда
		Пока РодительскаяГруппа<>Новый(ТипЗнч(РодительскаяГруппа)) Цикл
			Если РодительскаяГруппа.ВидНоменклатуры<>Новый(ТипЗнч(ВидНоменклатуры)) И ВидНоменклатуры=Новый(ТипЗнч(ВидНоменклатуры)) Тогда
				ВидНоменклатуры = РодительскаяГруппа.ВидНоменклатуры;
			КонецЕсли; 
			РодительскаяГруппа=РодительскаяГруппа.Родитель;
		КонецЦикла; 

		Если ВидНоменклатуры=Неопределено Тогда
			ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника.
Процедура ПередЗаписью(Отказ)
	
	Если ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Материал И
		 ЗначениеЗаполнено(ЕдиницаХраненияОстатков) 
	Тогда
		ЕдиницаХраненияОстатков = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор И ВестиУчетПоХарактеристикам Тогда
		ВестиУчетПоХарактеристикам = Ложь;
    КонецЕсли;
	
	Если Не ОбменДанными.Загрузка Тогда
		Ошибки = "";
		Если Не ПометкаУдаления 
			И Не ПроверитьКорректность(Ошибки) 
			Тогда
			#Если ТолстыйКлиентОбычноеприложение Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(Ошибки, Отказ);
			#Иначе
				ОбщегоНазначения.СообщитьОбОшибке(Ошибки, Отказ);
			#КонецЕсли 
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка
		И ЭтоНовый()
		И КодМедУслуги = 0
	Тогда
		КодМедУслуги = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
